{
  "education": [
    {
      "awards_achievements": [],
      "degree": "Bachelor of Software Engineering",
      "department": "Science and Engineering",
      "duration": "2023",
      "school_name": "Western Governor University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JohnTawadrous.git",
  "highlighted_projects": [
    {
      "description": "Bet-Mate is an engaging sports betting application centered around matchups. It allows users to create and participate in 1v1 betting contests. Users submit their predictions through Bet Slips, and each bet slip is compared against others in the matchup. The user with the most accurate predictions wins. The platform provides a dynamic and competitive environment for sports enthusiasts to test their betting skills and challenge others.",
      "name": "Sport Betting Application (OkayBetMate)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The project aims to develop a monitoring application for gathering and storing hardware information and usage statistics from multiple Linux hosts into a PostgreSQL database. This application targets system administrators and DevOps engineers who need to monitor system performance metrics over time. Technologies used include Bash scripting for automation, Docker for containerization of PostgreSQL, Git for version control, and SQL for database operations.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Grep App: The Grep app is a Java-based application that searches for a text pattern recursively within a given directory and outputs the matched lines to a file. It leverages core Java concepts, the SLF4J logging framework, and Java streams for efficient processing. The app has been dockerized for easier distribution and deployment.",
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "John Tawadrous",
  "others": [
    {
      "bullets": [
        "AWS Certified Solutions Architect",
        "ITIL v4 Foundation"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Design and implement scalable software solutions, leading development efforts for key projects, and optimizing application performance. Collaborate with cross-functional teams to define requirements and deliver high-quality software products. Leverage modern technologies and methodologies to drive continuous improvement and innovation in the development process.",
      "duration": "2024-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Docker",
      "Spring Boot",
      "AWS",
      "RESTful APIs"
    ],
    "familiar": [
      "JavaScript",
      "HTML/CSS",
      "Hibernate",
      "REACT",
      "ITIL"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "As a passionate software engineer, I am driven by the opportunity to tackle dynamic challenges and make meaningful contributions in the software development field. With a robust foundation in programming and a keen problem-solving aptitude, I thrive in environments that encourage continuous learning and innovation. My dedication to staying at the forefront of emerging technologies fuels my drive to create impactful solutions and drive positive change. I am eager to leverage my skills, creativity, and passion for innovation to propel forward-thinking organizations towards their goals."
}
